redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_F_OFF_1nd/redis_result_Gauss82_F_OFF_P3_1nd20230717220626.log
20        Threads
5         Connections per thread
50        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         7280.65          ---          ---         2.75742         2.70300         5.43900         5.91900      7863.67 
Gets        29114.31     29114.31         0.00         2.74120         2.67100         5.40700         5.91900     31303.57 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      36394.96     29114.31         0.00         2.74444         2.67100         5.40700         5.91900     39167.25 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.447        0.000
SET       2.447        5.000
SET       2.495       10.000
SET       2.511       15.000
SET       2.543       20.000
SET       2.559       25.000
SET       2.591       30.000
SET       2.607       35.000
SET       2.639       40.000
SET       2.671       45.000
SET       2.703       50.000
SET       2.719       52.500
SET       2.735       55.000
SET       2.751       57.500
SET       2.751       60.000
SET       2.767       62.500
SET       2.783       65.000
SET       2.799       67.500
SET       2.815       70.000
SET       2.815       72.500
SET       2.831       75.000
SET       2.831       76.250
SET       2.847       77.500
SET       2.847       78.750
SET       2.863       80.000
SET       2.863       81.250
SET       2.879       82.500
SET       2.879       83.750
SET       2.895       85.000
SET       2.895       86.250
SET       2.911       87.500
SET       2.911       88.125
SET       2.927       88.750
SET       2.927       89.375
SET       2.943       90.000
SET       2.943       90.625
SET       2.959       91.250
SET       2.975       91.875
SET       2.991       92.500
SET       3.007       93.125
SET       3.023       93.750
SET       3.039       94.062
SET       3.055       94.375
SET       3.071       94.688
SET       3.087       95.000
SET       3.103       95.312
SET       3.119       95.625
SET       3.135       95.938
SET       3.167       96.250
SET       3.199       96.562
SET       3.231       96.875
SET       3.279       97.031
SET       3.359       97.188
SET       3.535       97.344
SET       3.839       97.500
SET       4.767       97.656
SET       4.959       97.812
SET       5.023       97.969
SET       5.055       98.125
SET       5.119       98.281
SET       5.151       98.438
SET       5.183       98.516
SET       5.247       98.594
SET       5.279       98.672
SET       5.311       98.750
SET       5.343       98.828
SET       5.407       98.906
SET       5.439       98.984
SET       5.471       99.062
SET       5.503       99.141
SET       5.535       99.219
SET       5.567       99.258
SET       5.567       99.297
SET       5.599       99.336
SET       5.599       99.375
SET       5.631       99.414
SET       5.631       99.453
SET       5.663       99.492
SET       5.663       99.531
SET       5.695       99.570
SET       5.695       99.609
SET       5.695       99.629
SET       5.727       99.648
SET       5.727       99.668
SET       5.727       99.688
SET       5.759       99.707
SET       5.759       99.727
SET       5.759       99.746
SET       5.791       99.766
SET       5.791       99.785
SET       5.823       99.805
SET       5.823       99.814
SET       5.823       99.824
SET       5.855       99.834
SET       5.855       99.844
SET       5.855       99.854
SET       5.887       99.863
SET       5.887       99.873
SET       5.887       99.883
SET       5.919       99.893
SET       5.919       99.902
SET       5.951       99.907
SET       5.951       99.912
SET       5.951       99.917
SET       5.951       99.922
SET       5.983       99.927
SET       5.983       99.932
SET       5.983       99.937
SET       6.015       99.941
SET       6.015       99.946
SET       6.047       99.951
SET       6.047       99.954
SET       6.047       99.956
SET       6.047       99.958
SET       6.047       99.961
SET       6.079       99.963
SET       6.079       99.966
SET       6.111       99.968
SET       6.111       99.971
SET       6.143       99.973
SET       6.175       99.976
SET       6.207       99.977
SET       6.207       99.978
SET       6.207       99.979
SET       6.239       99.980
SET       6.271       99.982
SET       6.303       99.983
SET       6.399       99.984
SET       6.463       99.985
SET       6.495       99.987
SET       6.527       99.988
SET       6.623       99.988
SET       6.719       99.989
SET       6.911       99.990
SET       6.911       99.990
SET       6.943       99.991
SET       7.007       99.991
SET       7.327       99.992
SET       7.359       99.993
SET       7.391       99.993
SET       7.423       99.994
SET       7.647       99.994
SET       7.839       99.995
SET       7.935       99.995
SET       7.967       99.995
SET       8.191       99.995
SET       8.319       99.996
SET       8.703       99.996
SET       9.087       99.996
SET       9.151       99.997
SET       9.535       99.997
SET       9.535       99.997
SET       9.599       99.997
SET       9.599       99.997
SET       9.599       99.998
SET       9.599       99.998
SET       9.855       99.998
SET       9.855       99.998
SET      10.175       99.998
SET      10.175       99.998
SET      10.303       99.998
SET      10.303       99.999
SET      10.367       99.999
SET      10.367       99.999
SET      10.367       99.999
[...]
SET      10.559       99.999
SET      10.559       99.999
SET      10.559       99.999
[...]
SET      12.415       99.999
SET      12.415       99.999
SET      12.415       99.999
[...]
SET      12.415      100.000
SET      12.415      100.000
SET      12.415      100.000
[...]
SET      12.479      100.000
SET      12.479      100.000
---
GET       0.535        0.000
GET       2.415        5.000
GET       2.463       10.000
GET       2.495       15.000
GET       2.511       20.000
GET       2.543       25.000
GET       2.559       30.000
GET       2.575       35.000
GET       2.607       40.000
GET       2.639       45.000
GET       2.671       50.000
GET       2.687       52.500
GET       2.703       55.000
GET       2.719       57.500
GET       2.735       60.000
GET       2.751       62.500
GET       2.767       65.000
GET       2.767       67.500
GET       2.783       70.000
GET       2.799       72.500
GET       2.815       75.000
GET       2.815       76.250
GET       2.831       77.500
GET       2.831       78.750
GET       2.847       80.000
GET       2.847       81.250
GET       2.863       82.500
GET       2.863       83.750
GET       2.879       85.000
GET       2.879       86.250
GET       2.895       87.500
GET       2.895       88.125
GET       2.895       88.750
GET       2.911       89.375
GET       2.911       90.000
GET       2.927       90.625
GET       2.927       91.250
GET       2.943       91.875
GET       2.943       92.500
GET       2.959       93.125
GET       2.975       93.750
GET       2.991       94.062
GET       2.991       94.375
GET       3.007       94.688
GET       3.023       95.000
GET       3.039       95.312
GET       3.055       95.625
GET       3.071       95.938
GET       3.103       96.250
GET       3.119       96.562
GET       3.151       96.875
GET       3.167       97.031
GET       3.199       97.188
GET       3.215       97.344
GET       3.263       97.500
GET       3.551       97.656
GET       4.703       97.812
GET       4.927       97.969
GET       5.023       98.125
GET       5.055       98.281
GET       5.119       98.438
GET       5.151       98.516
GET       5.183       98.594
GET       5.215       98.672
GET       5.247       98.750
GET       5.311       98.828
GET       5.343       98.906
GET       5.375       98.984
GET       5.439       99.062
GET       5.471       99.141
GET       5.503       99.219
GET       5.535       99.258
GET       5.535       99.297
GET       5.567       99.336
GET       5.599       99.375
GET       5.599       99.414
GET       5.631       99.453
GET       5.631       99.492
GET       5.663       99.531
GET       5.663       99.570
GET       5.695       99.609
GET       5.695       99.629
GET       5.695       99.648
GET       5.727       99.668
GET       5.727       99.688
GET       5.727       99.707
GET       5.759       99.727
GET       5.759       99.746
GET       5.759       99.766
GET       5.791       99.785
GET       5.791       99.805
GET       5.791       99.814
GET       5.823       99.824
GET       5.823       99.834
GET       5.823       99.844
GET       5.855       99.854
GET       5.855       99.863
GET       5.855       99.873
GET       5.887       99.883
GET       5.887       99.893
GET       5.919       99.902
GET       5.919       99.907
GET       5.919       99.912
GET       5.919       99.917
GET       5.951       99.922
GET       5.951       99.927
GET       5.951       99.932
GET       5.983       99.937
GET       5.983       99.941
GET       5.983       99.946
GET       6.015       99.951
GET       6.015       99.954
GET       6.015       99.956
GET       6.015       99.958
GET       6.047       99.961
GET       6.047       99.963
GET       6.079       99.966
GET       6.079       99.968
GET       6.111       99.971
GET       6.111       99.973
GET       6.143       99.976
GET       6.175       99.977
GET       6.175       99.978
GET       6.207       99.979
GET       6.207       99.980
GET       6.239       99.982
GET       6.271       99.983
GET       6.335       99.984
GET       6.431       99.985
GET       6.559       99.987
GET       7.007       99.988
GET       7.295       99.988
GET       7.647       99.989
GET       8.255       99.990
GET       9.215       99.990
GET       9.855       99.991
GET      10.239       99.991
GET      11.007       99.992
GET      12.415       99.993
GET     266.239       99.993
GET     268.287       99.994
GET     268.287       99.994
GET     268.287       99.995
GET     268.287       99.995
GET     268.287       99.995
[...]
GET     268.287       99.996
GET     268.287       99.996
GET     268.287       99.996
GET     268.287       99.997
GET     268.287       99.997
GET     268.287       99.997
[...]
GET     268.287       99.998
GET     268.287       99.998
GET     268.287       99.998
[...]
GET     268.287       99.999
GET     268.287       99.999
GET     268.287       99.999
[...]
GET     268.287      100.000
GET     268.287      100.000
GET     268.287      100.000
[...]
GET     270.335      100.000
GET     270.335      100.000
---
WAIT      0.000      100.000